In [1]:
import pandas as pd
import numpy as np
import sqlite3
import glob
import os
import unittest

tc = unittest.TestCase()

In [2]:
glob.glob('*/*.csv')

['data/products.csv',
 'data/stores.csv',
 'data/inventory.csv',
 'data/sales.csv']

### Products table

In [3]:
df_products = pd.read_csv('data/products.csv')
df_products.columns = df_products.columns.to_series().str.lower()
df_products.head()

   product_id      product_name product_category product_cost product_price
0           1     Action Figure             Toys       $9.99        $15.99
1           2    Animal Figures             Toys       $9.99        $12.99
2           3   Barrel O' Slime     Art & Crafts       $1.99         $3.99
3           4  Chutes & Ladders            Games       $9.99        $12.99
4           5  Classic Dominoes            Games       $7.99         $9.99

In [4]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   product_id        35 non-null     int64
 1   product_name      35 non-null     object
 2   product_category  35 non-null     object
 3   product_cost      35 non-null     object
 4   product_price     35 non-null     object
dtypes: int64(1), object(4)
memory usage: 1.5+ KB

In [5]:
df_products['product_cost'] = df_products['product_cost'].str.replace('[\$,]', '', regex=True)
df_products['product_cost'] = df_products['product_cost'].astype(np.float64)

df_products['product_price'] = df_products['product_price'].str.replace('[\$,]', '', regex=True)
df_products['product_price'] = df_products['product_price'].astype(float)

In [6]:
tc = unittest.TestCase()
tc.assertTrue(
    pd.api.types.is_float_dtype(df_products['product_cost']),
    f"product_cost column must be a float type, current dtype is {df_products['product_cost'].dtype}"
)
tc.assertTrue(
    pd.api.types.is_float_dtype(df_products['product_price']),
    f"product_price column must be a float type, current dtype is {df_products['product_price'].dtype}"
)

In [7]:
df_stores = pd.read_csv('data/stores.csv')
df_stores.head()

,Store_ID,Store_Name,Store_City,Store_Location,Store_Open_Date
0,1,Maven Toys Guadalajara 1,Guadalajara,Residential,1992-09-18
1,2,Maven Toys Monterrey 1,Monterrey,Residential,1995-04-27
2,3,Maven Toys Guadalajara 2,Guadalajara,Commercial,1999-12-27
3,4,Maven Toys Saltillo 1,Saltillo,Downtown,2000-01-01
4,5,Maven Toys La Paz 1,La Paz,Downtown,2001-05-31

In [8]:
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Store_ID         50 non-null     int64
 1   Store_Name       50 non-null     object
 2   Store_City       50 non-null     object
 3   Store_Location   50 non-null     object
 4   Store_Open_Date  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [9]:
df_inventory = pd.read_csv('data/inventory.csv')
df_inventory.columns = df_inventory.columns.to_series().str.lower()
df_inventory.head()

   store_id  product_id  stock_on_hand
0         1           1             27
1         1           2              0
2         1           3             32
3         1           4              6
4         1           5              0

In [10]:
df_inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1593 entries, 0 to 1592
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   store_id       1593 non-null   int64
 1   product_id     1593 non-null   int64
 2   stock_on_hand  1593 non-null   int64
dtypes: int64(3)
memory usage: 37.5 KB

In [11]:
df_sales = pd.read_csv('data/sales.csv')
df_sales.columns = df_sales.columns.to_series().str.lower()
df_sales.head()

   sale_id        date  store_id  product_id  units
0        1  2017-01-01        24           4      1
1        2  2017-01-01        28           1      1
2        3  2017-01-01         6           8      1
3        4  2017-01-01        48           7      1
4        5  2017-01-01        44          18      1

In [12]:
df_sales.nunique()

sale_id       829262
date             638
store_id          50
product_id        35
units             27
dtype: int64

In [13]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 829262 entries, 0 to 829261
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   sale_id     829262 non-null  int64
 1   date        829262 non-null  object
 2   store_id    829262 non-null  int64
 3   product_id  829262 non-null  int64
 4   units       829262 non-null  int64
dtypes: int64(4), object(1)
memory usage: 31.6+ MB